INSERT INTO CategoryDepartment  VALUES
('משחקי קופסא'),
('משחקי חצר'),
('בובות משחק'),
('יצירות'),
('משחקי חשיבה');

INSERT INTO GameDepartment  VALUES
('קפלה בקופסת עץ', 1, 100, 'game1.jpg', 100),
('דליים וכלי חפירה לחצר', 2, 59.90, 'game2.jpg', 50),
('לגו', 1, 70, 'game3.jpg', 80),
('פאזל 1000 חלקים', 5, 150, 'game4.jpg', 30),
('פלסטלינה בגוונים שונים', 4, 40, 'game5.jpg', 200);

INSERT INTO CustomerDepartment  VALUES
('חנוך', 'password12', '1234-5678-9876-5432'),
('יהונתן', 'mypassword', '2345-6789-8765-4321'),
('טוביה', 'qwerty123', '3456-7890-7654-3210'),
('בנימין', 'pass321', '4567-8901-6543-2109'),
('אהרון', 'ahron9874', '5678-9012-5432-1098');

INSERT INTO ShoppingDepartment  VALUES
(2216, '2024-12-20 10:00:00', 139.90),
(4132, '2024-12-21 14:30:00', 130),
(3174, '2024-12-22 16:00:00', 200),
(5090, '2024-12-22 18:15:00', 67.90),
(1258, '2024-12-23 11:45:00', 108.50);

select *
from ShoppingDepartment

INSERT INTO PurchaseDetailsDepartment VALUES
(112, 12, 2),
(123, 11, 1),
(134, 10, 1),
(145, 14, 3),
(156, 10, 2);



